{
"caesar": {
  "title": "César classique",
  "description": "Le chiffrement de César consiste à décaler chaque lettre du message d’un nombre fixe de positions dans l’alphabet. Les lettres dépassant la fin de l’alphabet recommencent au début.",
  "formula": "E(x) = (x + k) mod 26",
  "example": "Avec k = 3 : A → D, B → E, Z → C. Le mot \"BONJOUR\" devient \"ERQMRXU\"."
},

"rot": {
  "title": "ROT",
  "description": "Les chiffrements ROT sont une famille de chiffrements par substitution dérivés du chiffrement de César. Le principe consiste à effectuer une rotation des caractères d’un message d’un nombre fixe de positions à l’intérieur d’un ensemble de caractères donné. Selon la variante ROT utilisée, la rotation peut s’appliquer uniquement aux lettres, aux chiffres, ou à un ensemble plus large incluant les caractères ASCII imprimables.",
  "formula": "E(x) = (x + k) mod N",
  "example": "Les chiffrements ROT appliquent une rotation fixe : ROT13 décale les lettres de 13 positions, ROT18 combine ROT13 pour les lettres et ROT5 pour les chiffres, et ROT47 effectue une rotation sur tous les caractères ASCII imprimables. Dans de nombreux cas, la même opération permet à la fois le chiffrement et le déchiffrement."
},

"rot13": {
  "title": "ROT13",
  "description": "Le chiffrement ROT13 est une variante du chiffre de César utilisant un décalage fixe de 13 positions sur l’alphabet. Il est particulier car il est symétrique : chiffrer et déchiffrer utilisent la même opération.",
  "formula": "E(x) = (x + 13) mod 26",
  "example": "ROT13 : A → N, B → O, N → A. Le mot \"PYTHON\" devient \"CLGUBA\"."
},

"rot18": {
  "title": "ROT18",
  "description": "Le chiffrement ROT18 combine deux chiffrements : ROT13 pour les lettres (A–Z) et ROT5 pour les chiffres (0–9). Les autres caractères ne sont pas modifiés.",
  "formula": "Lettres : E(x) = (x + 13) mod 26 | Chiffres : E(n) = (n + 5) mod 10",
  "example": "ROT18 : A → N, 1 → 6. Le texte \"HELLO123\" devient \"URYYB678\"."
},

"rot47": {
  "title": "ROT47",
  "description": "Le chiffrement ROT47 est une extension du chiffre de César qui s’applique aux caractères ASCII imprimables (de '!' à '~'). Il utilise un décalage de 47 positions et chiffre lettres, chiffres et symboles.",
  "formula": "E(x) = 33 + ((x − 33 + 47) mod 94)",
  "example": "ROT47 : A → p, ! → P. Le texte \"Hello!\" devient \"w6==@P\"."
},

"poly": {
  "title": "César polyalphabétique",
  "description": "Le chiffrement polyalphabétique utilise plusieurs décalages successifs au lieu d’un seul. Chaque lettre est chiffrée avec un décalage différent, ce qui renforce la sécurité.",
  "formula": "E(xᵢ) = (xᵢ + kᵢ) mod 26",
  "example": "Avec la clé '1, 2, 3' : A → B, B → D, C → F. Le motif de clés se répète sur tout le message."
},

"vigenere": {
  "title": "Vigenère",
  "description": "Le chiffrement de Vigenère est un chiffrement polyalphabétique basé sur un mot-clé. Chaque lettre du message est décalée selon la lettre correspondante du mot-clé.",
  "formula": "E(xᵢ) = (xᵢ + kᵢ) mod 26",
  "example": "Avec la clé \"CLE\" : A → C, B → M, C → G. Le mot \"BONJOUR\" devient \"DZYNSFV\"."
},

"affine_manual": {
  "title": "César affine (Clées manuelles)",
  "description": "Choississez manuellement les deux clées. La première clé(a) doit être première avec 26 afin de permettre le déchiffrement (1, 3, 5, 7, 9, 11, 15, 17, 19, 21, 23, 25).",
  "formula": "E(x) = (a × x + b) mod 26",
  "example": "Avec a = 5 et b = 8 : A → I, B → N. Le mot \"HELLO\" devient \"RCLLA\"."
},

"affine_auto": {
  "title": "César affine (Clées automatiques)",
  "description": "La première clé(a) est choisie aléatoirement parmi une liste de nombre premier avec 26 (1, 3, 5, 7, 9, 11, 15, 17, 19, 21, 23, 25) afin de permettre le déchiffrement (1, 3, 5, 7, 9, 11, 15, 17, 19, 21, 23, 25).",
  "formula": "E(x) = (a × x + b) mod 26",
  "example": "Avec a = 5 et b = 8 : A → I, B → N. Le mot \"HELLO\" devient \"RCLLA\"."
},

"affine": {
  "title": "César affine",
  "description": "Le chiffrement affine améliore le César classique en utilisant une fonction mathématique affine avec deux clés. La première clé doit être première avec 26 afin de permettre le déchiffrement.",
  "formula": "E(x) = (a × x + b) mod 26",
  "example": "Avec a = 5 et b = 8 : A → I, B → N. Le mot \"HELLO\" devient \"RCLLA\"."
},

"otp": {
  "title": "Masque Jetable (OTP)",
  "description": "Le Masque Jetable est une technique de chiffrement symétrique qui utilise une clé aussi longue que le message. Chaque caractère du texte clair est combiné avec le caractère correspondant de la clé grâce à une opération XOR binaire. La clé doit être véritablement aléatoire et utilisée une seule fois pour garantir une sécurité parfaite.",
  "formula": "Cᵢ = Pᵢ ⊕ Kᵢ",
  "example": "Message : 'BONJOUR', Clé : [30, 190, 165, 67, 46, 153, 251], Chiffre : ['Z', 'ì', '¦', ']', 't', ...]. Le déchiffrement utilise la même clé avec l'opération XOR."
}
}
